###############################################################################
# Created by write_sdc
# Sun May 15 22:36:51 2022
###############################################################################
current_design Configuration
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Index[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core1Index[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {manufacturerID[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {partID[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {versionID[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {versionID[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {versionID[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {versionID[3]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {core0Index[7]}]
set_load -pin_load 0.0334 [get_ports {core0Index[6]}]
set_load -pin_load 0.0334 [get_ports {core0Index[5]}]
set_load -pin_load 0.0334 [get_ports {core0Index[4]}]
set_load -pin_load 0.0334 [get_ports {core0Index[3]}]
set_load -pin_load 0.0334 [get_ports {core0Index[2]}]
set_load -pin_load 0.0334 [get_ports {core0Index[1]}]
set_load -pin_load 0.0334 [get_ports {core0Index[0]}]
set_load -pin_load 0.0334 [get_ports {core1Index[7]}]
set_load -pin_load 0.0334 [get_ports {core1Index[6]}]
set_load -pin_load 0.0334 [get_ports {core1Index[5]}]
set_load -pin_load 0.0334 [get_ports {core1Index[4]}]
set_load -pin_load 0.0334 [get_ports {core1Index[3]}]
set_load -pin_load 0.0334 [get_ports {core1Index[2]}]
set_load -pin_load 0.0334 [get_ports {core1Index[1]}]
set_load -pin_load 0.0334 [get_ports {core1Index[0]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[10]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[9]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[8]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[7]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[6]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[5]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[4]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[3]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[2]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[1]}]
set_load -pin_load 0.0334 [get_ports {manufacturerID[0]}]
set_load -pin_load 0.0334 [get_ports {partID[15]}]
set_load -pin_load 0.0334 [get_ports {partID[14]}]
set_load -pin_load 0.0334 [get_ports {partID[13]}]
set_load -pin_load 0.0334 [get_ports {partID[12]}]
set_load -pin_load 0.0334 [get_ports {partID[11]}]
set_load -pin_load 0.0334 [get_ports {partID[10]}]
set_load -pin_load 0.0334 [get_ports {partID[9]}]
set_load -pin_load 0.0334 [get_ports {partID[8]}]
set_load -pin_load 0.0334 [get_ports {partID[7]}]
set_load -pin_load 0.0334 [get_ports {partID[6]}]
set_load -pin_load 0.0334 [get_ports {partID[5]}]
set_load -pin_load 0.0334 [get_ports {partID[4]}]
set_load -pin_load 0.0334 [get_ports {partID[3]}]
set_load -pin_load 0.0334 [get_ports {partID[2]}]
set_load -pin_load 0.0334 [get_ports {partID[1]}]
set_load -pin_load 0.0334 [get_ports {partID[0]}]
set_load -pin_load 0.0334 [get_ports {versionID[3]}]
set_load -pin_load 0.0334 [get_ports {versionID[2]}]
set_load -pin_load 0.0334 [get_ports {versionID[1]}]
set_load -pin_load 0.0334 [get_ports {versionID[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
