###############################################################################
# Created by write_sdc
# Mon May 16 19:24:33 2022
###############################################################################
current_design Flash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Address[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0ByteSelect[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0ByteSelect[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0ByteSelect[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0ByteSelect[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataWrite[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0ReadEnable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0WriteEnable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_io0_read}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_io1_read}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0Busy}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {core0DataRead[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_csb}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_io0_we}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_io0_write}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_io1_we}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_io1_write}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {flash_sck}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {core0Busy}]
set_load -pin_load 0.0334 [get_ports {flash_csb}]
set_load -pin_load 0.0334 [get_ports {flash_io0_we}]
set_load -pin_load 0.0334 [get_ports {flash_io0_write}]
set_load -pin_load 0.0334 [get_ports {flash_io1_we}]
set_load -pin_load 0.0334 [get_ports {flash_io1_write}]
set_load -pin_load 0.0334 [get_ports {flash_sck}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[31]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[30]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[29]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[28]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[27]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[26]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[25]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[24]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[23]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[22]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[21]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[20]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[19]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[18]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[17]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[16]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[15]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[14]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[13]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[12]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[11]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[10]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[9]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[8]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[7]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[6]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[5]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[4]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[3]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[2]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[1]}]
set_load -pin_load 0.0334 [get_ports {core0DataRead[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0ReadEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0WriteEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io0_read}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io1_read}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0Address[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0ByteSelect[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0ByteSelect[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0ByteSelect[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0ByteSelect[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core0DataWrite[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
